Tekla Open API Reference for Tekla Structures 2025
AnalysisMember Methods
The AnalysisMember type exposes the following members.
Methods
Name | Description
CopyData
 Copies data from another analysis member.
Modify
 Modifies an analysis member. The AnalysisModelName has to be set.
Select
 Selects an analysis member. The AnalysisModelName and ID have to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisMember Class
Tekla.Structures.Analysis Namespace